<svg
  id="_레이어_2"
  data-name="레이어 2"
  xmlns="http://www.w3.org/2000/svg"
  xmlns:xlink="http://www.w3.org/1999/xlink"
  viewBox="0 0 485.91 82.05"
>
  <defs>
    <style>
      .clsnox-1 {
        fill: url(#_무제_그라디언트_9-6);
      }

      .clsnox-2 {
        fill: url(#_무제_그라디언트_9-5);
      }

      .clsnox-3 {
        fill: url(#_무제_그라디언트_9-4);
      }

      .clsnox-4 {
        fill: url(#_무제_그라디언트_9-3);
      }

      .clsnox-5 {
        fill: url(#_무제_그라디언트_9-2);
      }

      .clsnox-6 {
        fill: url(#_무제_그라디언트_9);
      }
    </style>
    <linearGradient
      id="_무제_그라디언트_9"
      data-name="무제 그라디언트 9"
      x1="488.29"
      y1="40.97"
      x2="-2.99"
      y2="40.97"
      gradientUnits="userSpaceOnUse"
    >
      <stop offset="0" stop-color="#533399" />
      <stop offset="1" stop-color="#ff00f7" />
    </linearGradient>
    <linearGradient
      id="_무제_그라디언트_9-2"
      data-name="무제 그라디언트 9"
      y1="41.02"
      x2="-2.99"
      y2="41.02"
      xlink:href="#_무제_그라디언트_9"
    />
    <linearGradient
      id="_무제_그라디언트_9-3"
      data-name="무제 그라디언트 9"
      y1="40.97"
      x2="-2.99"
      y2="40.97"
      xlink:href="#_무제_그라디언트_9"
    />
    <linearGradient
      id="_무제_그라디언트_9-4"
      data-name="무제 그라디언트 9"
      y1="40.97"
      x2="-2.99"
      y2="40.97"
      xlink:href="#_무제_그라디언트_9"
    />
    <linearGradient
      id="_무제_그라디언트_9-5"
      data-name="무제 그라디언트 9"
      y1="40.97"
      x2="-2.99"
      y2="40.97"
      xlink:href="#_무제_그라디언트_9"
    />
    <linearGradient
      id="_무제_그라디언트_9-6"
      data-name="무제 그라디언트 9"
      y1="40.97"
      x2="-2.99"
      y2="40.97"
      xlink:href="#_무제_그라디언트_9"
    />
  </defs>
  <g id="_레이어_1-2" data-name="레이어 1">
    <g>
      <path
        class="clsnox-6"
        d="m51.36,39.26H2.31v39.04h53.45l-.55,2.09H0V1.54h53.67v2.09H2.31v33.54h49.05v2.09Z"
      />
      <path
        class="clsnox-5"
        d="m139.35,59.83c-5.5,14.08-15.73,22.22-35.31,22.22-24.42,0-38.38-18.59-38.38-40.91C65.66,16.94,81.39,0,104.93,0c19.69,0,30.58,9.79,34.43,22.77h-2.42c-3.63-11.11-13.64-20.68-32.01-20.68-21.89,0-36.84,15.62-36.84,38.93,0,21.23,13.75,38.83,36.19,38.83,17.93,0,27.39-7.48,32.67-20.13l2.42.11Z"
      />
      <path
        class="clsnox-4"
        d="m231.63,40.25c0,23.32-14.96,41.68-39.92,41.68-23.43,0-39.59-17.93-39.59-41.03S168.5,0,192.14,0s39.48,17.71,39.48,40.25Zm-77.1.55c0,20.68,14.52,39.04,37.29,39.04s37.4-16.17,37.4-39.38c0-20.68-15.29-38.38-37.18-38.38s-37.5,16.83-37.5,38.71Z"
      />
      <path
        class="clsnox-3"
        d="m250.33,80.4V1.54h2.75c15.84,19.69,54.77,67.97,60.71,75.56h.11c-.44-5.17-.33-23.54-.33-36.19V1.54h2.31v78.86h-2.42c-15.4-19.25-57.74-71.71-61.04-76.33h-.11c.44,10.34.33,23.1.33,36.74v39.59h-2.31Z"
      />
      <path
        class="clsnox-2"
        d="m413.98,40.25c0,23.32-14.96,41.68-39.93,41.68-23.43,0-39.59-17.93-39.59-41.03S350.85,0,374.5,0s39.49,17.71,39.49,40.25Zm-77.1.55c0,20.68,14.52,39.04,37.29,39.04s37.4-16.17,37.4-39.38c0-20.68-15.29-38.38-37.18-38.38s-37.51,16.83-37.51,38.71Z"
      />
      <path
        class="clsnox-1"
        d="m482.94,80.4l-30.14-39.71h-.11l-31.02,39.71h-2.86l32.55-41.46L422.34,1.54h2.86l27.5,35.53h.11L481.84,1.54h2.97l-30.69,37.29,31.79,41.57h-2.97Z"
      />
    </g>
  </g>
</svg>
